RafaelMicro/matter_sdk/third_party/openthread/ot-nxp/boards/rt1170/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitArduinoUARTPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: R13, peripheral: LPUART7, signal: CTS_B, pin_signal: GPIO_AD_02, software_input_on: Disable,
pull_keeper_select: Keeper}
  - {pin_num: P15, peripheral: LPUART7, signal: RTS_B, pin_signal: GPIO_AD_03, software_input_on: Disable,
pull_keeper_select: Keeper}
  - {pin_num: N12, peripheral: LPUART7, signal: TXD, pin_signal: GPIO_AD_00, pull_up_down_config: Pull_Down,
pull_keeper_select: Keeper}
  - {pin_num: R14, peripheral: LPUART7, signal: RXD, pin_signal: GPIO_AD_01, pull_up_down_config: Pull_Down,
pull_keeper_select: Keeper}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitArduinoUARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitArduinoUARTPins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* LPCG on: LPCG is ON. */

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_02_LPUART7_CTS_B, /* GPIO_AD_02 is configured as LPUART7_CTS_B */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_03_LPUART7_RTS_B, /* GPIO_AD_03 is configured as LPUART7_RTS_B */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_LPUART7_TXD, /* GPIO_AD_00 is configured as LPUART7_TXD */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_LPUART7_RXD, /* GPIO_AD_01 is configured as LPUART7_RXD */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_02_LPUART7_CTS_B, /* GPIO_AD_02 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_03_LPUART7_RTS_B, /* GPIO_AD_03 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_00_LPUART7_TXD,   /* GPIO_AD_00 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_01_LPUART7_RXD,   /* GPIO_AD_01 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: high drive strength
                                                            Pull / Keep Select Field: Pull Disable, Highz
                                                            Pull Up / Down Config. Field: Weak pull down
                                                            Open Drain Field: Disabled
                                                            Domain write protection: Both cores are allowed
                                                            Domain write protection lock: Neither of DWP bits is locked */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitOtSPI6Pins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: P16, peripheral: GPIO3, signal: 'gpio_mux_io, 10', pin_signal: GPIO_AD_11, direction: INPUT,
gpio_interrupt: no_init}
  - {pin_num: T5, peripheral: LPSPI6, signal: SOUT, pin_signal: GPIO_LPSR_11, software_input_on: Disable,
pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High, slew_rate: Fast}
  - {pin_num: U5, peripheral: LPSPI6, signal: SIN, pin_signal: GPIO_LPSR_12, slew_rate: Fast}
  - {pin_num: R5, peripheral: LPSPI6, signal: SCK, pin_signal: GPIO_LPSR_10, slew_rate: Fast}
  - {pin_num: P5, peripheral: LPSPI6, signal: PCS0, pin_signal: GPIO_LPSR_09, pull_up_down_config: Pull_Up, slew_rate:
Fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

