RafaelMicro/matter_sdk/third_party/openthread/ot-nxp/boards/rt1170/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOtSPI6Pins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOtSPI6Pins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* LPCG on: LPCG is ON. */

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_11_GPIO_MUX3_IO10, /* GPIO_AD_11 is configured as GPIO_MUX3_IO10 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_09_LPSPI6_PCS0, /* GPIO_LPSR_09 is configured as LPSPI6_PCS0 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_10_LPSPI6_SCK, /* GPIO_LPSR_10 is configured as LPSPI6_SCK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_11_LPSPI6_SOUT, /* GPIO_LPSR_11 is configured as LPSPI6_SOUT */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_12_LPSPI6_SIN, /* GPIO_LPSR_12 is configured as LPSPI6_SIN */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_09_LPSPI6_PCS0,  /* GPIO_LPSR_09 PAD functional properties : */
                        0x02U);                           /* Slew Rate Field: Slow Slew Rate
                                                       Drive Strength Field: high driver
                                                       Pull / Keep Select Field: Pull Disable
                                                       Pull Up / Down Config. Field: Weak pull down
                                                       Open Drain LPSR Field: Disabled
                                                       Domain write protection: Both cores are allowed
                                                       Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_11_GPIO_MUX3_IO10, /* GPIO_AD_11 PAD functional properties : */
                        0x0EU);                           /* Slew Rate Field: Slow Slew Rate
                                                       Drive Strength Field: high drive strength
                                                       Pull / Keep Select Field: Pull Enable
                                                       Pull Up / Down Config. Field: Weak pull up
                                                       Open Drain Field: Disabled
                                                       Domain write protection: Both cores are allowed
                                                       Domain write protection lock: Neither of DWP bits is locked */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_10_LPSPI6_SCK,  /* GPIO_LPSR_10 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                      Drive Strength Field: high driver
                                                      Pull / Keep Select Field: Pull Disable
                                                      Pull Up / Down Config. Field: Weak pull down
                                                      Open Drain LPSR Field: Disabled
                                                      Domain write protection: Both cores are allowed
                                                      Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_11_LPSPI6_SOUT, /* GPIO_LPSR_11 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                      Drive Strength Field: high driver
                                                      Pull / Keep Select Field: Pull Disable
                                                      Pull Up / Down Config. Field: Weak pull down
                                                      Open Drain LPSR Field: Disabled
                                                      Domain write protection: Both cores are allowed
                                                      Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_12_LPSPI6_SIN,  /* GPIO_LPSR_12 PAD functional properties : */
                        0x02U);                          /* Slew Rate Field: Slow Slew Rate
                                                      Drive Strength Field: high driver
                                                      Pull / Keep Select Field: Pull Disable
                                                      Pull Up / Down Config. Field: Weak pull down
                                                      Open Drain LPSR Field: Disabled
                                                      Domain write protection: Both cores are allowed
                                                      Domain write protection lock: Neither of DWP bits is locked */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitOtSPI1Pins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: P16, peripheral: GPIO3, signal: 'gpio_mux_io, 10', pin_signal: GPIO_AD_11, direction: INPUT,
gpio_interrupt: no_init, pull_up_down_config: Pull_Up, pull_keeper_select: Pull, slew_rate: Fast}
  - {pin_num: K17, peripheral: LPSPI1, signal: SOUT, pin_signal: GPIO_AD_30, identifier: '', software_input_on: Enable,
open_drain: Disable, drive_strength: High, slew_rate: Fast}
  - {pin_num: J17, peripheral: LPSPI1, signal: SIN, pin_signal: GPIO_AD_31, identifier: '', software_input_on: Enable,
open_drain: Disable, drive_strength: High, slew_rate: Fast}
  - {pin_num: L17, peripheral: LPSPI1, signal: SCK, pin_signal: GPIO_AD_28, identifier: '', software_input_on: Enable,
open_drain: Disable, drive_strength: High, slew_rate: Fast}
  - {pin_num: M17, peripheral: LPSPI1, signal: PCS0, pin_signal: GPIO_AD_29, identifier: '', software_input_on: Enable,
pull_up_down_config: Pull_Up, pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

