RafaelMicro/matter_sdk/third_party/openthread/ot-nxp/boards/rt1170/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOtSPI1Pins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOtSPI1Pins(void)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* LPCG on: LPCG is ON. */

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_11_GPIO_MUX3_IO10, /* GPIO_AD_11 is configured as GPIO_MUX3_IO10 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_28_LPSPI1_SCK,  /* GPIO_AD_28 is configured as LPSPI1_SCK */
                     1U);                           /* Software Input On Field: Force input path of pad GPIO_AD_28 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_29_LPSPI1_PCS0, /* GPIO_AD_29 is configured as LPSPI1_PCS0 */
                     1U);                           /* Software Input On Field: Force input path of pad GPIO_AD_29 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_30_LPSPI1_SOUT, /* GPIO_AD_30 is configured as LPSPI1_SOUT */
                     1U);                           /* Software Input On Field: Force input path of pad GPIO_AD_30 */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_31_LPSPI1_SIN,  /* GPIO_AD_31 is configured as LPSPI1_SIN */
                     1U);                           /* Software Input On Field: Force input path of pad GPIO_AD_31 */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_11_GPIO_MUX3_IO10, /* GPIO_AD_11 PAD functional properties : */
                        0x0FU);                           /* Slew Rate Field: Fast Slew Rate
                                                       Drive Strength Field: high drive strength
                                                       Pull / Keep Select Field: Pull Enable
                                                       Pull Up / Down Config. Field: Weak pull up
                                                       Open Drain Field: Disabled
                                                       Domain write protection: Both cores are allowed
                                                       Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_28_LPSPI1_SCK,     /* GPIO_AD_28 PAD functional properties : */
                        0x07U);                           /* Slew Rate Field: Fast Slew Rate
                                                       Drive Strength Field: high drive strength
                                                       Pull / Keep Select Field: Pull Enable
                                                       Pull Up / Down Config. Field: Weak pull down
                                                       Open Drain Field: Disabled
                                                       Domain write protection: Both cores are allowed
                                                       Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_29_LPSPI1_PCS0,    /* GPIO_AD_29 PAD functional properties : */
                        0x0FU);                           /* Slew Rate Field: Fast Slew Rate
                                                       Drive Strength Field: high drive strength
                                                       Pull / Keep Select Field: Pull Enable
                                                       Pull Up / Down Config. Field: Weak pull up
                                                       Open Drain Field: Disabled
                                                       Domain write protection: Both cores are allowed
                                                       Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_30_LPSPI1_SOUT,    /* GPIO_AD_30 PAD functional properties : */
                        0x07U);                           /* Slew Rate Field: Fast Slew Rate
                                                       Drive Strength Field: high drive strength
                                                       Pull / Keep Select Field: Pull Enable
                                                       Pull Up / Down Config. Field: Weak pull down
                                                       Open Drain Field: Disabled
                                                       Domain write protection: Both cores are allowed
                                                       Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_31_LPSPI1_SIN,     /* GPIO_AD_31 PAD functional properties : */
                        0x07U);                           /* Slew Rate Field: Fast Slew Rate
                                                       Drive Strength Field: high drive strength
                                                       Pull / Keep Select Field: Pull Enable
                                                       Pull Up / Down Config. Field: Weak pull down
                                                       Open Drain Field: Disabled
                                                       Domain write protection: Both cores are allowed
                                                       Domain write protection lock: Neither of DWP bits is locked */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: E14, peripheral: FLEXSPI1, signal: FLEXSPI_A_DQS, pin_signal: GPIO_SD_B2_05, software_input_on: Enable,
pull_down_pull_up_config: Pull_Down, pdrv_config: Normal_Driver}
  - {pin_num: F17, peripheral: FLEXSPI1, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_SD_B2_06, software_input_on: Enable,
pull_down_pull_up_config: Pull_Down, pdrv_config: Normal_Driver}
  - {pin_num: G14, peripheral: FLEXSPI1, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_SD_B2_07, software_input_on: Enable,
pdrv_config: Normal_Driver}
  - {pin_num: F15, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_SD_B2_08, software_input_on: Enable,
pdrv_config: Normal_Driver}
  - {pin_num: H15, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_SD_B2_09, software_input_on: Enable,
pdrv_config: Normal_Driver}
  - {pin_num: H14, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_SD_B2_10, software_input_on: Enable,
pdrv_config: Normal_Driver}
  - {pin_num: F16, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_SD_B2_11, software_input_on: Enable,
pdrv_config: Normal_Driver}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

